fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Бозырь С.Р. 22.07.2025</comment>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияСотрудника</name>
      <type>
        <types>EnumRef.ВКМ_КатегорииСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТЗОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресТЗОтпусков);
	ГодАнализа  = Параметры.ГодАнализа;
				
	Для Каждого Отпуск Из ТЗОтпусков Цикл
		
		Точка = ДиаграммаОтпусков.УстановитьТочку(Отпуск.Сотрудник);
		Точка.Текст = Отпуск.Сотрудник;
		
		Серия = ДиаграммаОтпусков.УстановитьСерию(Отпуск.КатегорияСотрудника);
		Серия.Текст = Отпуск.КатегорияСотрудника;   
		
		Значение = ДиаграммаОтпусков.ПолучитьЗначение(Точка, Серия);  

		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		Интервал.Текст = Отпуск.Сотрудник;  
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
